---
type: MultipleValuesIndicationSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# MultipleValuesIndicationSettings

`Autodesk.Revit.DB.MultipleValuesIndicationSettings` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetMultipleValuesIndicationSettings | 2022 | `public static MultipleValuesIndicationSettings GetMultipleValuesIndicationSettings ( Document cda )` |
| Property | Custom | 2022 | `public bool Custom { get ; set ; }` |
| Property | CustomValue | 2022 | `public string CustomValue { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Value | 2022 | `public string Value { get ; }` |